{
  "users": [
    {
      "id": "1",
      "username": "JohnDoe",
      "password": "123456",
      "email": "john@example.com",
      "profilePic": "/api/placeholder/200/200",
      "bio": "Penulis cerita fantasy dan adventure",
      "followers": ["2", "3"],
      "following": ["2"],
      "stories": ["1", "3"],
      "joinDate": "2025-01-15T10:30:00Z"
    },
    {
      "id": "2",
      "username": "JaneSmith",
      "password": "123456",
      "email": "jane@example.com",
      "profilePic": "/api/placeholder/200/200",
      "bio": "Pecinta cerita romance dan slice of life",
      "followers": ["1"],
      "following": ["1", "3"],
      "stories": ["2", "5"],
      "joinDate": "2025-02-10T14:22:00Z"
    },
    {
      "id": "3",
      "username": "MikeRoss",
      "password": "123456",
      "email": "mike@example.com",
      "profilePic": "/api/placeholder/200/200",
      "bio": "Horror writer and enthusiast",
      "followers": ["2"],
      "following": ["1"],
      "stories": ["4"],
      "joinDate": "2025-03-05T09:15:00Z"
    }
  ],
  "stories": [
    {
      "id": "1",
      "title": "Petualangan di Hutan Terlarang",
      "content": "Pada suatu hari, di sebuah desa kecil yang terletak di pinggir hutan terlarang, hiduplah seorang pemuda bernama Raden. Raden selalu penasaran dengan apa yang ada di dalam hutan terlarang tersebut. Meskipun orangtuanya selalu melarangnya untuk mendekati hutan itu, rasa penasarannya semakin hari semakin menjadi-jadi.\n\nSuatu malam, Raden bermimpi bertemu dengan seorang kakek tua yang memberitahunya bahwa di dalam hutan terlarang terdapat sebuah permata ajaib yang dapat menyembuhkan segala penyakit. Kebetulan, ibu Raden sedang sakit parah dan dokter desa sudah menyerah untuk mengobatinya.\n\nTanpa berpikir panjang, Raden memutuskan untuk memasuki hutan terlarang tersebut. Dia hanya membawa satu tas kecil berisi air minum, roti, dan sebuah pisau kecil untuk perlindungan diri.\n\nBegitu memasuki hutan, suasana berubah mencekam. Pohon-pohon besar menjulang tinggi, menghalangi cahaya matahari. Suara-suara aneh terdengar dari segala penjuru. Namun, tekad Raden sudah bulat.\n\nSetelah berjalan selama beberapa jam, Raden menemukan sebuah gua kecil. Di dalam gua tersebut, dia melihat cahaya berwarna biru yang berkilauan. Ketika dia mendekati cahaya tersebut, dia menemukan sebuah permata berwarna biru terang.\n\n\"Ini pasti permata yang disebutkan dalam mimpiku,\" pikir Raden.\n\nNamun, ketika dia hendak mengambil permata tersebut, tiba-tiba muncul seekor ular raksasa yang menjaga permata itu. Ular tersebut mendesis keras, siap menyerang Raden.\n\nRaden yang ketakutan mencoba untuk tenang. Dia teringat nasihat neneknya bahwa semua makhluk di dunia ini memiliki hati. Dengan keberanian yang tersisa, Raden berbicara kepada ular tersebut.\n\n\"Aku tidak bermaksud jahat. Aku hanya ingin meminjam permata ini untuk menyembuhkan ibuku yang sakit parah. Aku berjanji akan mengembalikannya setelah ibuku sembuh.\"\n\nAjaibnya, ular tersebut seolah-olah mengerti perkataan Raden. Ular itu mundur perlahan, membiarkan Raden mengambil permata tersebut.\n\nDengan hati yang penuh sukacita, Raden bergegas kembali ke desanya. Begitu sampai di rumah, dia meletakkan permata tersebut di samping ibunya yang terbaring lemah. Seketika itu juga, cahaya biru dari permata tersebut menyelimuti tubuh ibunya, dan perlahan-lahan, ibunya membuka mata.\n\n\"Raden, apa yang terjadi?\" tanya ibunya dengan suara yang sudah jauh lebih kuat.\n\nRaden menceritakan semua petualangannya kepada ibunya. Ibunya yang sudah sehat kembali memeluk Raden dengan penuh kasih sayang.\n\nSesuai dengan janjinya, keesokan harinya Raden kembali ke hutan terlarang untuk mengembalikan permata tersebut. Ketika dia tiba di gua, ular raksasa itu sudah menunggunya. Raden meletakkan permata itu di tempatnya semula.\n\n\"Terima kasih telah meminjamkannya padaku. Ibuku sekarang sudah sembuh,\" kata Raden.\n\nUlar itu mengangguk, seolah-olah memahami perkataan Raden. Kemudian, ular itu berubah wujud menjadi seorang pria tua yang tampak bijaksana.\n\n\"Kau telah menepati janjimu, anak muda. Karena kejujuran dan kebaikan hatimu, aku akan memberikan permata ini kepadamu. Gunakanlah untuk membantu orang-orang yang membutuhkan,\" kata pria tua tersebut.\n\nRaden terkejut, tetapi dengan rendah hati dia menerima pemberian tersebut. Sejak saat itu, desa kecil tempat Raden tinggal berubah menjadi desa yang makmur. Tidak ada lagi orang yang sakit parah, karena Raden selalu siap membantu dengan permata ajaibnya.\n\nDan hutan terlarang? Tidak ada lagi yang menyebutnya demikian. Sekarang hutan itu disebut 'Hutan Harapan', tempat di mana keajaiban bisa terjadi bagi mereka yang memiliki hati yang tulus.",
      "coverImage": "/api/placeholder/600/400",
      "authorId": "1",
      "author": "JohnDoe",
      "authorAvatar": "/api/placeholder/200/200",
      "createdAt": "2025-03-10T08:15:00Z",
      "updatedAt": "2025-03-10T08:15:00Z",
      "genre": "Fantasy",
      "likes": 27,
      "likedBy": ["2", "3"],
      "views": 142,
      "comments": [
        {
          "id": "1",
          "authorId": "2",
          "author": "JaneSmith",
          "content": "Cerita yang sangat menarik! Saya suka dengan pesan moral yang disampaikan.",
          "createdAt": "2025-03-11T14:22:00Z"
        },
        {
          "id": "2",
          "authorId": "3",
          "author": "MikeRoss",
          "content": "Wow, plot twist di akhir cerita tidak terduga. Bagus sekali!",
          "createdAt": "2025-03-12T19:05:00Z"
        }
      ]
    },
    {
      "id": "2",
      "title": "Surat yang Tak Terkirim",
      "content": "Setiap hari, tepat pukul 3 sore, Pak Pos selalu melewati rumah tua di ujung jalan. Rumah itu sudah tidak berpenghuni selama hampir 10 tahun, tetapi entah mengapa, Pak Pos selalu menemukan sebuah surat di kotak pos rumah tersebut.\n\nSurat-surat itu selalu sama, ditujukan kepada seseorang bernama 'Lintang' dengan alamat di kota yang berbeda-beda setiap minggunya. Tidak ada nama pengirim, hanya sebuah tanda tangan yang hampir tak terbaca.\n\nAwalnya, Pak Pos berpikir bahwa itu hanyalah ulah jahil anak-anak sekitar. Namun, setelah kejadian aneh mulai terjadi, dia mulai curiga.\n\nSuatu hari, Pak Pos memutuskan untuk tidak mengambil surat tersebut. Keesokan harinya, dia menemukan surat yang sama, tetapi kali ini basah oleh air - padahal saat itu tidak hujan. Hari berikutnya, dia kembali mengabaikan surat tersebut, dan keesokan harinya surat itu ditemukan dengan bekas terbakar di pinggirnya.\n\nPenasaran, Pak Pos akhirnya memutuskan untuk membuka salah satu surat tersebut. Isinya hanya satu kalimat: \"Aku masih menunggumu pulang.\"\n\nPak Pos mulai mencari tahu tentang rumah tua tersebut. Dari cerita penduduk setempat, dia mengetahui bahwa rumah itu dulu dimiliki oleh sepasang kekasih, Dimas dan Lintang. Mereka berencana untuk menikah, tetapi Lintang harus pergi ke luar negeri untuk melanjutkan studinya. Dimas berjanji akan menunggunya.\n\nNamun, takdir berkata lain. Dimas mengalami kecelakaan dan meninggal sehari sebelum Lintang kembali. Lintang yang terpukul kemudian menjual rumah itu dan tidak pernah kembali.\n\nSejak saat itu, Pak Pos mulai mengirimkan semua surat tersebut ke alamat yang tertera. Meskipun dia tahu bahwa surat-surat itu tidak akan pernah sampai ke tangan Lintang, setidaknya dia telah membantu Dimas untuk tetap mencoba berkomunikasi dengan kekasihnya, meskipun dari dunia yang berbeda.",
      "coverImage": "/api/placeholder/600/400",
      "authorId": "2",
      "author": "JaneSmith",
      "authorAvatar": "/api/placeholder/200/200",
      "createdAt": "2025-04-05T15:30:00Z",
      "updatedAt": "2025-04-05T15:30:00Z",
      "genre": "Romance",
      "likes": 42,
      "likedBy": ["1", "3"],
      "views": 215,
      "comments": [
        {
          "id": "3",
          "authorId": "1",
          "author": "JohnDoe",
          "content": "Cerita ini membuat saya menitikkan air mata. Sangat menyentuh!",
          "createdAt": "2025-04-06T09:18:00Z"
        }
      ]
    },
    {
      "id": "3",
      "title": "Jejak Kaki di Pasir",
      "content": "Pantai selalu menjadi tempat favorit Maya untuk menenangkan pikiran. Suara ombak yang berirama, semilir angin yang lembut, dan bentangan pasir putih seolah menjadi terapi bagi jiwanya yang lelah.\n\nHari itu, seperti biasa, Maya berjalan menyusuri tepi pantai. Matahari mulai tenggelam, menciptakan pemandangan senja yang menakjubkan. Langkahnya terhenti ketika dia melihat jejak kaki di pasir. Jejak kaki itu tidak menuju ke arah laut atau darat, melainkan seolah-olah muncul dan menghilang begitu saja di tengah-tengah pantai.\n\nPenasaran, Maya mengikuti jejak kaki tersebut. Anehnya, semakin dia mengikuti jejak itu, semakin dia merasa familiar dengan arah yang dituju. Jejak kaki itu akhirnya berakhir di sebuah titik di mana Maya dan mantan kekasihnya, Dika, sering menghabiskan waktu bersama dulu.\n\nMaya terduduk di pasir, merenungi kenangan indah yang pernah mereka lalui. Sudah tiga tahun sejak Dika pergi meninggalkannya tanpa kabar, tanpa penjelasan.\n\n\"Aku selalu tahu kamu akan kembali ke tempat ini,\" sebuah suara mengejutkan Maya.\n\nMaya menoleh dan melihat sosok yang sangat dia kenal. Dika, dengan senyuman yang sama, tetapi dengan mata yang penuh rasa bersalah.\n\n\"Aku kembali untuk meminta maaf dan menjelaskan semuanya,\" kata Dika sambil duduk di samping Maya.\n\nDika menceritakan bahwa tiga tahun lalu, dia didiagnosis menderita penyakit langka dan dokter memvonis hidupnya tidak akan lama lagi. Dia memutuskan untuk pergi tanpa memberitahu Maya, karena dia tidak ingin Maya melihatnya dalam kondisi terburuknya.\n\n\"Tapi, aku berhasil melawan penyakitku. Dokter menyebutnya sebagai keajaiban,\" lanjut Dika.\n\nMaya tidak tahu harus bereaksi seperti apa. Ada campuran perasaan marah, lega, dan bahagia dalam dirinya.\n\n\"Aku tidak memintamu untuk kembali padaku. Aku hanya ingin kamu tahu kebenarannya,\" kata Dika sambil beranjak pergi.\n\nMaya menatap jejak kaki Dika di pasir, jejak yang sama dengan yang dia ikuti tadi. Tanpa pikir panjang, Maya berlari mengejar Dika.\n\n\"Tiga tahun aku menunggumu tanpa kabar. Sekarang kamu kembali dan berpikir bisa pergi begitu saja?\" Maya mencengkeram lengan Dika.\n\nMata mereka bertemu, dan tanpa kata-kata, mereka tahu bahwa meskipun waktu telah berlalu, cinta mereka tetap ada, seperti jejak kaki di pasir yang selalu kembali meskipun dihapus oleh ombak.",
      "coverImage": "/api/placeholder/600/400",
      "authorId": "1",
      "author": "JohnDoe",
      "authorAvatar": "/api/placeholder/200/200",
      "createdAt": "2025-04-22T11:45:00Z",
      "updatedAt": "2025-04-22T11:45:00Z",
      "genre": "Romance",
      "likes": 38,
      "likedBy": ["2"],
      "views": 176,
      "comments": []
    },
    {
      "id": "4",
      "title": "Bisikan dari Cermin",
      "content": "\"Jangan pernah menatap cermin terlalu lama saat tengah malam,\" begitu pesan yang selalu diulang-ulang oleh nenek Clara sebelum beliau meninggal. Clara selalu menganggap itu hanya mitos, sampai suatu malam, ketika dia tidak sengaja melakukannya.\n\nMalam itu, Clara pulang larut dari pesta ulang tahun temannya. Dengan wajah lelah, dia berdiri di depan cermin di kamar mandi untuk membersihkan makeup-nya. Jam di dinding menunjukkan pukul 11:58 malam.\n\nKetika Clara sedang fokus menghapus eyeliner-nya, tiba-tiba lampu kamar mandi berkedip. Clara mengabaikannya dan terus menatap cermin. Tepat saat jarum jam menunjukkan pukul 00:00, bayangan Clara di cermin tersenyum - padahal Clara sendiri tidak tersenyum.\n\n\"Akhirnya kita bertemu, Clara,\" bayangan itu berbicara.\n\nClara terkejut dan mundur beberapa langkah. Dia mengucek matanya, berpikir bahwa itu hanya halusinasinya karena terlalu lelah.\n\n\"Kau tidak berhalusinasi, Clara. Aku nyata. Aku adalah kau, tetapi dari dimensi lain,\" kata bayangan itu.\n\nBayangan itu menceritakan bahwa dunia cermin adalah dimensi paralel dari dunia Clara. Mereka hidup dengan kehidupan yang sama persis, tetapi terbalik. Apa yang baik di dunia Clara, adalah jahat di dunia cermin, dan sebaliknya.\n\n\"Selama ini, aku terjebak menjadi bayanganmu. Tapi malam ini, tepat di tengah malam, kita bisa bertukar tempat,\" bayangan itu menjelaskan dengan senyum yang mencurigakan.\n\nClara, yang ketakutan, mencoba untuk meninggalkan kamar mandi. Namun, kakinya seperti terpaku di lantai. Dia merasakan tubuhnya ditarik ke arah cermin, sementara bayangannya perlahan-lahan keluar dari cermin.\n\nDengan sisa tenaganya, Clara teringat pesan neneknya, \"Untuk menghentikan pertukaran, kau harus memecahkan cermin sebelum prosesnya selesai.\"\n\nClara meraih sikat gigi dan melemparkannya ke arah cermin. Cermin itu pecah berkeping-keping, dan bayangan Clara menjerit kesakitan sebelum kembali ke cermin.\n\nSejak kejadian itu, Clara menutupi semua cermin di rumahnya saat malam hari. Dia tahu bahwa bayangan itu masih menunggunya di balik cermin, menunggu kesempatan lain untuk bertukar tempat dengannya.",
      "coverImage": "/api/placeholder/600/400",
      "authorId": "3",
      "author": "MikeRoss",
      "authorAvatar": "/api/placeholder/200/200",
      "createdAt": "2025-05-01T22:10:00Z",
      "updatedAt": "2025-05-01T22:10:00Z",
      "genre": "Horror",
      "likes": 19,
      "likedBy": ["1"],
      "views": 98,
      "comments": [
        {
          "id": "4",
          "authorId": "1",
          "author": "JohnDoe",
          "content": "Seram sekali! Aku jadi tidak berani menatap cermin terlalu lama sekarang.",
          "createdAt": "2025-05-02T08:45:00Z"
        }
      ]
    },
    {
      "id": "5",
      "title": "Hujan di Bulan Juni",
      "content": "Hujan di bulan Juni adalah hal yang langka, setidaknya di kota kecil tempat Rina tinggal. Tetapi tahun ini, hujan turun hampir setiap hari di bulan Juni. Para ilmuwan menyebutnya sebagai anomali cuaca, tetapi bagi Rina, hujan ini memiliki arti yang lebih dalam.\n\nSetiap tetes hujan yang jatuh mengingatkannya pada Dani, kekasihnya yang pergi meninggalkan kota untuk mengejar mimpinya di ibukota. \"Aku akan kembali saat hujan turun di bulan Juni,\" begitu janji Dani sebelum pergi.\n\nSudah lima tahun sejak Dani pergi, dan selama itu pula, tidak pernah sekalipun hujan turun di bulan Juni. Hingga tahun ini.\n\nDengan harapan yang membuncah, Rina selalu duduk di teras rumahnya setiap kali hujan turun, menunggu kedatangan Dani. Namun, hingga hari ke-29 di bulan Juni, Dani belum juga muncul.\n\n\"Mungkin itu hanya janji kosong,\" pikir Rina dengan hati yang mulai menyerah.\n\nPada tanggal 30 Juni, hujan turun dengan deras. Rina memutuskan untuk tidak lagi menunggu di teras. Dia memilih untuk mengemas semua kenangan tentang Dani dan siap untuk melangkah maju.\n\nKetika dia sedang memasukkan foto-foto lama ke dalam kotak, bel rumahnya berbunyi. Dengan enggan, Rina membuka pintu dan terkejut melihat sosok yang basah kuyup berdiri di depannya.\n\n\"Maaf aku terlambat. Tapi aku sudah kembali, seperti janjiku,\" kata Dani dengan senyum yang masih sama seperti lima tahun lalu.\n\nRina tidak tahu harus berkata apa. Ada campuran perasaan marah, lega, dan bahagia dalam dirinya.\n\n\"Lima tahun, Dani. Lima tahun aku menunggumu,\" kata Rina dengan suara bergetar.\n\nDani menjelaskan bahwa dia selalu ingin kembali setiap tahun, tetapi dia ingin memastikan bahwa dia telah sukses dan layak untuk Rina. Dan tahun ini, akhirnya dia berhasil.\n\n\"Aku tahu ini tidak adil untukmu. Tapi, bolehkah aku meminta kesempatan kedua?\" tanya Dani sambil mengulurkan sebuah cincin.\n\nRina menatap cincin itu, kemudian menatap mata Dani yang penuh harap. Hujan masih turun dengan deras di luar sana, mengiringi momen penting dalam hidup mereka.\n\n\"Kau tahu, selama lima tahun ini, aku selalu berharap hujan turun di bulan Juni,\" kata Rina sambil tersenyum dan menerima cincin tersebut.\n\nDan pada hari terakhir di bulan Juni itu, di tengah hujan yang langka, Rina dan Dani menemukan kembali cinta yang sempat hilang.",
      "coverImage": "/api/placeholder/600/400",
      "authorId": "2",
      "author": "JaneSmith",
      "authorAvatar": "/api/placeholder/200/200",
      "createdAt": "2025-05-10T16:20:00Z",
      "updatedAt": "2025-05-10T16:20:00Z",
      "genre": "Romance",
      "likes": 56,
      "likedBy": ["1", "3"],
      "views": 267,
      "comments": [
        {
          "id": "5",
          "authorId": "3",
          "author": "MikeRoss",
          "content": "Cerita romantis yang indah. Aku suka penggambaran hujannya yang menjadi simbol harapan.",
          "createdAt": "2025-05-11T21:34:00Z"
        },
        {
          "id": "6",
          "authorId": "1",
          "author": "JohnDoe",
          "content": "Endingnya sangat mengesankan! Ini mengajarkan kita untuk tetap memiliki harapan.",
          "createdAt": "2025-05-12T10:15:00Z"
        }
      ]
    }
  ]
}
